In [1]:
# Function to check if a number is prime
def is_prime(n):
    if n <= 1:
        return False

    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False

    return True


number_to_check = 7
if is_prime(number_to_check):
    print(number_to_check, "is a prime number.")
else:
    print(number_to_check, "is not a prime number.")

7 is a prime number.

In [2]:
start = 1
end = 20
divisor = 3
divisible_numbers = [x for x in range(start, end+1) if x % divisor == 0]
print("Numbers in the range", start, "to", end, "that are divisible by", divisor, ":", divisible_numbers)

Numbers in the range 1 to 20 that are divisible by 3 : [3, 6, 9, 12, 15, 18]

In [1]:
import pandas as pd
iris_data = pd.read_csv('/content/sample_data/iris.csv')
print("The start of the data set:")
print(iris_data.head())
print("\n Names of columns:")
print(iris_data.columns)
print("\n Data type:")
print(iris_data.dtypes)

The start of the data set:
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

 Names of columns:
Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

 Data type:
sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [4]:
import pandas as pd
boston_data = pd.read_csv('/content/sample_data/BostonHousing.csv')
print("First few rows of the dataset:")
print(boston_data.head())
column_name = 'medv'
mean_value = boston_data[column_name].mean()
print(f"\nMean of {column_name}: {mean_value}")
median_value = boston_data[column_name].median()
print(f"Median of {column_name}: {median_value}")
std_dev_value = boston_data[column_name].std()
print(f"Standard Deviation of {column_name}: {std_dev_value}")

First few rows of the dataset:
      crim    zn  indus  chas    nox     rm   age     dis  rad  tax  ptratio  \
0  0.00632  18.0   2.31     0  0.538  6.575  65.2  4.0900    1  296     15.3
1  0.02731   0.0   7.07     0  0.469  6.421  78.9  4.9671    2  242     17.8
2  0.02729   0.0   7.07     0  0.469  7.185  61.1  4.9671    2  242     17.8
3  0.03237   0.0   2.18     0  0.458  6.998  45.8  6.0622    3  222     18.7
4  0.06905   0.0   2.18     0  0.458  7.147  54.2  6.0622    3  222     18.7

        b  lstat  medv
0  396.90   4.98  24.0
1  396.90   9.14  21.6
2  392.83   4.03  34.7
3  394.63   2.94  33.4
4  396.90   5.33  36.2

Mean of medv: 22.532806324110677
Median of medv: 21.2
Standard Deviation of medv: 9.197104087379818

In [6]:
import pandas as pd
titanic_data = pd.read_csv('/content/sample_data/tested.csv')
print("First few rows of the dataset:")
print(titanic_data.head())
titanic_data['Sex'] = titanic_data['Sex'].map({'female': 0, 'male': 1})
print("\nFirst few rows after transforming 'Sex' column:")
print(titanic_data.head())

   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S
First few rows of the dataset:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name     Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    male  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0
2                     Myles, Mr. Thomas Francis    male  62.0      0      0
3                              Wirz, Mr. Albert    male  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S

First few rows after transforming 'Sex' column:
   PassengerId  Survived  Pclass  \
0          892         0       3
1          893         1       3
2          894         0       2
3          895         0       3
4          896         1       3

                                           Name  Sex   Age  SibSp  Parch  \
0                              Kelly, Mr. James    1  34.5      0      0
1              Wilkes, Mrs. James (Ellen Needs)    0  47.0      1      0
2                     Myles, Mr. Thomas Francis    1  62.0      0      0
3                              Wirz, Mr. Albert    1  27.0      0      0
4  Hirvonen, Mrs. Alexander (Helga E Lindqvist)    0  22.0      1      1

    Ticket     Fare Cabin Embarked
0   330911   7.8292   NaN        Q
1   363272   7.0000   NaN        S
2   240276   9.6875   NaN        Q
3   315154   8.6625   NaN        S
4  3101298  12.2875   NaN        S